## Concat Pandas DataFrames

<div class="alert alert-block" style="border: 1px solid #FFB300;background-color:#F9FBE7;">
<font size="4em" style="font-weight:bold;color:#3f8dbf;">1. Import Library</font><br>
</div>

In [3]:
import pandas as pd

<div class="alert alert-block" style="border: 1px solid #FFB300;background-color:#F9FBE7;">
<font size="4em" style="font-weight:bold;color:#3f8dbf;">2. Create Data Frames</font><br>
</div>

In [15]:
#Student Data 
student_data = {
    "Student_Id": [101, 102, 103, 104, 105],
    "Name": ["Ben", "Danielle", "Sam", "Will", "Melissa"],
    "Gender": ["male", "female", "male", "male", "female"],
    "Phone_Num": [5924, 1933, 3481, 2752, 9873]
}

#Books in KU library 
book_data = {
    "Book_Id": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    "Title": ["The Old Man and the Sea", "The Little Prince", "My Sweet Orange Tree", "Harry Potter", "Moby-Dick", "The Catcher in the Rye", "Big Fish", "Norwegian Wood", "Pride and Prejudice", "The Girl Who Leapt Through Time"],
    "Author": ["Ernest Hemingway", "Antoine de Saint-Exupéry", "Rio de Janeiro", "J. K. Rowling", "Herman Melville", "David Salinger", "Daniel Wallace", "Haruki Murakami", "Jane Austen", "Yasutaka Tsutsui"]
}

#Create Dataframes
student_df = pd.DataFrame(student_data)
book_df = pd.DataFrame(book_data)

In [22]:
student_df

   Student_Id      Name  Gender  Phone_Num
0         101       Ben    male       5924
1         102  Danielle  female       1933
2         103       Sam    male       3481
3         104      Will    male       2752
4         105   Melissa  female       9873

In [21]:
book_df

   Book_Id                            Title                    Author
0        1          The Old Man and the Sea          Ernest Hemingway
1        2                The Little Prince  Antoine de Saint-Exupéry
2        3             My Sweet Orange Tree            Rio de Janeiro
3        4                     Harry Potter             J. K. Rowling
4        5                        Moby-Dick           Herman Melville
5        6           The Catcher in the Rye            David Salinger
6        7                         Big Fish            Daniel Wallace
7        8                   Norwegian Wood           Haruki Murakami
8        9              Pride and Prejudice               Jane Austen
9       10  The Girl Who Leapt Through Time          Yasutaka Tsutsui

In [23]:
#Check-out on April
checkout_april = {
    "Student_Id": [101, 104, 101, 102, 105],
    "Book_Id": [4, 2, 3, 9, 10],
    "Date": ["2022-04-01", "2022-04-03", "2022-04-11", "2022-04-21", "2022-04-28"]
}

#Check-out on May
checkout_may = {
    "Student_Id": [103, 104, 101, 105, 101, 103, 102],
    "Book_Id": [1, 4, 5, 8, 7, 5, 6],
    "Date": ["2022-05-02", "2022-05-03", "2022-05-09", "2022-05-11", "2022-05-13", "2022-05-22", "2022-05-25"]
}

#Create Dataframes
checkout_april_df = pd.DataFrame(checkout_april)
checkout_may_df = pd.DataFrame(checkout_may)

In [26]:
checkout_april_df

   Student_Id  Book_Id        Date
0         101        4  2022-04-01
1         104        2  2022-04-03
2         101        3  2022-04-11
3         102        9  2022-04-21
4         105       10  2022-04-28

<div class="alert alert-block" style="border: 1px solid #FFB300;background-color:#F9FBE7;">
<font size="4em" style="font-weight:bold;color:#3f8dbf;">3. Concatenate DataFrame Objects</font><br>
</div>

>- <b>axis=0 (default)</b>: When concatenating along the index

In [27]:
pd.concat([checkout_april_df, checkout_may_df])

   Student_Id  Book_Id        Date
0         101        4  2022-04-01
1         104        2  2022-04-03
2         101        3  2022-04-11
3         102        9  2022-04-21
4         105       10  2022-04-28
0         103        1  2022-05-02
1         104        4  2022-05-03
2         101        5  2022-05-09
3         105        8  2022-05-11
4         101        7  2022-05-13
5         103        5  2022-05-22
6         102        6  2022-05-25

>- <b>axis=1</b>: When concatenating along the columns

In [28]:
pd.concat([checkout_april_df, checkout_may_df], axis=1)

   Student_Id  Book_Id        Date  Student_Id  Book_Id        Date
0       101.0      4.0  2022-04-01         103        1  2022-05-02
1       104.0      2.0  2022-04-03         104        4  2022-05-03
2       101.0      3.0  2022-04-11         101        5  2022-05-09
3       102.0      9.0  2022-04-21         105        8  2022-05-11
4       105.0     10.0  2022-04-28         101        7  2022-05-13
5         NaN      NaN         NaN         103        5  2022-05-22
6         NaN      NaN         NaN         102        6  2022-05-25